Revit 2026 API

# AdvancedWoodWoodDiffuseLobeWeight Property

---

The property labeled "Weight of diffuse lobe" from the "AdvancedWood" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string WoodDiffuseLobeWeight { get; }
```
```vb
Public Shared ReadOnly Property WoodDiffuseLobeWeight As String
	Get
```
```cpp
public:
static property String^ WoodDiffuseLobeWeight {
	String^ get ();
}
```
```fsharp
static member WoodDiffuseLobeWeight : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble".

#### Reference

AdvancedWood Class

Autodesk.Revit.DB.Visual Namespace